app/controllers/bookmarks_controller.rb

  def create
    @bookmark = @list.bookmarks.build(bookmark_params)
    @bookmark.list = @list
    if @bookmark.save
---
INSERT INTO "bookmarks" ("movie_id", "list_id", "comment", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["movie_id", 3], ["list_id", 1], ["comment", "9183748194719234748"], ["created_at", "2024-02-22 15:37:31.114970"], ["updated_at", "2024-02-22 15:37:31.114970"]]

  def set_list
    @list = List.find(params[:list_id])
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]