app/controllers/lists_controller.rb

  def create
    @list = List.new(list_params)
    if @list.save
---
INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Valdis"], ["created_at", "2024-02-22 15:28:46.645264"], ["updated_at", "2024-02-22 15:28:46.645264"]]